---
title: SpatialElementTag
classe: Autodesk.Revit.DB.SpatialElementTag
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# SpatialElementTag

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean HasElbow { get; }` | `spatialElementTag.HasElbow` | Boolean |
| `Boolean HasLeader { get; set; }` | `spatialElementTag.HasLeader` | Boolean |
| `Boolean IsOrphaned { get; }` | `spatialElementTag.IsOrphaned` | Boolean |
| `Boolean IsTaggingLink { get; }` | `spatialElementTag.IsTaggingLink` | Boolean |
| `XYZ LeaderElbow { get; set; }` | `spatialElementTag.LeaderElbow` | XYZ |
| `XYZ LeaderEnd { get; set; }` | `spatialElementTag.LeaderEnd` | XYZ |
| `Location Location { get; }` | `spatialElementTag.Location` | Location |
| `Double RotationAngle { get; set; }` | `spatialElementTag.RotationAngle` | Double |
| `XYZ TagHeadPosition { get; set; }` | `spatialElementTag.TagHeadPosition` | XYZ |
| `SpatialElementTagOrientation TagOrientation { get; set; }` | `spatialElementTag.TagOrientation` | SpatialElementTagOrientation |
| `String TagText { get; }` | `spatialElementTag.TagText` | String |
| `View View { get; }` | `spatialElementTag.View` | View |
| `Void MoveToReferenceLocation()` | `spatialElementTag.MoveToReferenceLocation()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```